zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz2038ca70144.h
/*
 * \brief Configuration of the CORTEX-M7 Processor and Core Peripherals
 */
#define __CM7_REV                 0x0101 /**< CM7 Core Revision                                                         */
#define __NVIC_PRIO_BITS               3 /**< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0 /**< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1 /**< MPU present or not                                                        */
#define __VTOR_PRESENT                 1 /**< Vector Table Offset Register present or not                               */
#define __FPU_PRESENT                  1 /**< FPU present or not                                                        */
#define __FPU_DP                       1 /**< Double Precision FPU                                                      */
#define __ICACHE_PRESENT               1 /**< Instruction Cache present                                                 */
#define __DCACHE_PRESENT               1 /**< Data Cache present                                                        */
#define __ITCM_PRESENT                 1 /**< Instruction TCM present                                                   */
#define __DTCM_PRESENT                 1 /**< Data TCM present                                                          */
#define __ARCH_ARM                     1
#define __ARCH_ARM_CORTEX_M            1
#define __DEVICE_IS_PIC32C             1

/*
 * \brief CMSIS includes
 */
#include <core_cm7.h>
#if !defined DONT_USE_CMSIS_INIT
#include "system_ca70.h"
#endif /* DONT_USE_CMSIS_INIT */

/** @}  end of PIC32CZ2038CA70144_cmsis CMSIS Definitions */

/** \defgroup PIC32CZ2038CA70144_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CZ2038CA70144                */
/* ************************************************************************** */
#include "component/acc.h"
#include "component/aes.h"
#include "component/afec.h"
#include "component/chipid.h"
#include "component/dacc.h"
#include "component/efc.h"
#include "component/gmac.h"
#include "component/gpbr.h"
#include "component/hsmci.h"
#include "component/i2sc.h"
#include "component/icm.h"
#include "component/isi.h"
#include "component/matrix.h"
#include "component/mcan.h"
#include "component/mlb.h"
#include "component/port.h"
#include "component/pmc.h"
#include "component/pwmc.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rswdt.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/sdramc.h"
#include "component/smc.h"
#include "component/spi.h"
#include "component/ssc.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/trng.h"
#include "component/twi.h"
#include "component/uart.h"
#include "component/usart.h"
#include "component/usbhs.h"
#include "component/utmi.h"
#include "component/wdt.h"
#include "component/xdmac.h"
/** @}  end of Peripheral Software API */

/** \addtogroup PIC32CZ2038CA70144_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CZ2038CA70144                          */
/* ************************************************************************** */
#define ID_SUPC          (  0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC          (  1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC           (  2) /**< \brief Real-time Clock (RTC) */
#define ID_RTT           (  3) /**< \brief Real-time Timer (RTT) */
#define ID_WDT           (  4) /**< \brief Watchdog Timer (WDT) */
#define ID_PMC           (  5) /**< \brief Power Management Controller (PMC) */
#define ID_EFC           (  6) /**< \brief Embedded Flash Controller (EFC) */
#define ID_UART0         (  7) /**< \brief Universal Asynchronous Receiver Transmitter (UART0) */
#define ID_UART1         (  8) /**< \brief Universal Asynchronous Receiver Transmitter (UART1) */
#define ID_SMC           (  9) /**< \brief Static Memory Controller (SMC) */
#define ID_PORTA         ( 10) /**< \brief Port (PORTA) */
#define ID_PORTB         ( 11) /**< \brief Port (PORTB) */
#define ID_PORTC         ( 12) /**< \brief Port (PORTC) */
#define ID_USART0        ( 13) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
#define ID_USART1        ( 14) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
#define ID_USART2        ( 15) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
#define ID_PORTD         ( 16) /**< \brief Port (PORTD) */
#define ID_PORTE         ( 17) /**< \brief Port (PORTE) */
#define ID_HSMCI         ( 18) /**< \brief High Speed MultiMedia Card Interface (HSMCI) */
#define ID_TWI0          ( 19) /**< \brief Two-wire Interface (TWI0) */
#define ID_TWI1          ( 20) /**< \brief Two-wire Interface (TWI1) */
#define ID_SPI0          ( 21) /**< \brief Serial Peripheral Interface (SPI0) */
#define ID_SSC           ( 22) /**< \brief Synchronous Serial Controller (SSC) */
#define ID_TC0_CHANNEL0  ( 23) /**< \brief Timer Counter (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1  ( 24) /**< \brief Timer Counter (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2  ( 25) /**< \brief Timer Counter (TC0_CHANNEL2) */
#define ID_TC1_CHANNEL0  ( 26) /**< \brief Timer Counter (TC1_CHANNEL0) */
#define ID_TC1_CHANNEL1  ( 27) /**< \brief Timer Counter (TC1_CHANNEL1) */
#define ID_TC1_CHANNEL2  ( 28) /**< \brief Timer Counter (TC1_CHANNEL2) */
#define ID_AFEC0         ( 29) /**< \brief Analog Front-End Controller (AFEC0) */
#define ID_DACC          ( 30) /**< \brief Digital-to-Analog Converter Controller (DACC) */
#define ID_PWMC0         ( 31) /**< \brief Pulse Width Modulation Controller (PWMC0) */
#define ID_ICM           ( 32) /**< \brief Integrity Check Monitor (ICM) */
#define ID_ACC           ( 33) /**< \brief Analog Comparator Controller (ACC) */
#define ID_USBHS         ( 34) /**< \brief USB High-Speed Interface (USBHS) */
#define ID_MCAN0         ( 35) /**< \brief Controller Area Network (MCAN0) */
#define ID_MCAN1         ( 37) /**< \brief Controller Area Network (MCAN1) */
#define ID_GMAC          ( 39) /**< \brief Gigabit Ethernet MAC (GMAC) */
#define ID_AFEC1         ( 40) /**< \brief Analog Front-End Controller (AFEC1) */
#define ID_TWI2          ( 41) /**< \brief Two-wire Interface (TWI2) */
#define ID_SPI1          ( 42) /**< \brief Serial Peripheral Interface (SPI1) */
#define ID_QSPI          ( 43) /**< \brief Quad Serial Peripheral Interface (QSPI) */
#define ID_UART2         ( 44) /**< \brief Universal Asynchronous Receiver Transmitter (UART2) */
#define ID_UART3         ( 45) /**< \brief Universal Asynchronous Receiver Transmitter (UART3) */
#define ID_UART4         ( 46) /**< \brief Universal Asynchronous Receiver Transmitter (UART4) */
#define ID_TC2_CHANNEL0  ( 47) /**< \brief Timer Counter (TC2_CHANNEL0) */
#define ID_TC2_CHANNEL1  ( 48) /**< \brief Timer Counter (TC2_CHANNEL1) */
#define ID_TC2_CHANNEL2  ( 49) /**< \brief Timer Counter (TC2_CHANNEL2) */
#define ID_TC3_CHANNEL0  ( 50) /**< \brief Timer Counter (TC3_CHANNEL0) */
#define ID_TC3_CHANNEL1  ( 51) /**< \brief Timer Counter (TC3_CHANNEL1) */
#define ID_TC3_CHANNEL2  ( 52) /**< \brief Timer Counter (TC3_CHANNEL2) */
#define ID_MLB           ( 53) /**< \brief MediaLB (MLB) */
#define ID_AES           ( 56) /**< \brief Advanced Encryption Standard (AES) */
#define ID_TRNG          ( 57) /**< \brief True Random Number Generator (TRNG) */
#define ID_XDMAC         ( 58) /**< \brief Extensible DMA Controller (XDMAC) */
#define ID_ISI           ( 59) /**< \brief Image Sensor Interface (ISI) */
#define ID_PWMC1         ( 60) /**< \brief Pulse Width Modulation Controller (PWMC1) */
#define ID_SDRAMC        ( 62) /**< \brief SDRAM Controller (SDRAMC) */
#define ID_RSWDT         ( 63) /**< \brief Reinforced Safety Watchdog Timer (RSWDT) */
#define ID_I2SC0         ( 69) /**< \brief Inter-IC Sound Controller (I2SC0) */
#define ID_I2SC1         ( 70) /**< \brief Inter-IC Sound Controller (I2SC1) */

#define ID_PERIPH_COUNT  ( 71) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup PIC32CZ2038CA70144_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CZ2038CA70144            */
/* ************************************************************************** */
#define _ACC_REGS                        CAST(acc_registers_t, 0x40044000)             /**< \brief ACC Registers Address        */
#define _AES_REGS                        CAST(aes_registers_t, 0x4006c000)             /**< \brief AES Registers Address        */
#define _AFEC0_REGS                      CAST(afec_registers_t, 0x4003c000)            /**< \brief AFEC0 Registers Address      */
#define _AFEC1_REGS                      CAST(afec_registers_t, 0x40064000)            /**< \brief AFEC1 Registers Address      */
#define _CHIPID_REGS                     CAST(chipid_registers_t, 0x400e0940)          /**< \brief CHIPID Registers Address     */
#define _DACC_REGS                       CAST(dacc_registers_t, 0x40040000)            /**< \brief DACC Registers Address       */
#define _EFC_REGS                        CAST(efc_registers_t, 0x400e0c00)             /**< \brief EFC Registers Address        */
#define _GMAC_REGS                       CAST(gmac_registers_t, 0x40050000)            /**< \brief GMAC Registers Address       */
#define _GPBR_REGS                       CAST(gpbr_registers_t, 0x400e1890)            /**< \brief GPBR Registers Address       */
#define _HSMCI_REGS                      CAST(hsmci_registers_t, 0x40000000)           /**< \brief HSMCI Registers Address      */
#define _I2SC0_REGS                      CAST(i2sc_registers_t, 0x4008c000)            /**< \brief I2SC0 Registers Address      */
#define _I2SC1_REGS                      CAST(i2sc_registers_t, 0x40090000)            /**< \brief I2SC1 Registers Address      */
#define _ICM_REGS                        CAST(icm_registers_t, 0x40048000)             /**< \brief ICM Registers Address        */
#define _ISI_REGS                        CAST(isi_registers_t, 0x4004c000)             /**< \brief ISI Registers Address        */
#define _MATRIX_REGS                     CAST(matrix_registers_t, 0x40088000)          /**< \brief MATRIX Registers Address     */
#define _MCAN0_REGS                      CAST(mcan_registers_t, 0x40030000)            /**< \brief MCAN0 Registers Address      */
#define _MCAN1_REGS                      CAST(mcan_registers_t, 0x40034000)            /**< \brief MCAN1 Registers Address      */
#define _MLB_REGS                        CAST(mlb_registers_t, 0x40068000)             /**< \brief MLB Registers Address        */
#define _PORTA_REGS                      CAST(port_registers_t, 0x400e0e00)            /**< \brief PORTA Registers Address      */
#define _PORTB_REGS                      CAST(port_registers_t, 0x400e1000)            /**< \brief PORTB Registers Address      */
#define _PORTC_REGS                      CAST(port_registers_t, 0x400e1200)            /**< \brief PORTC Registers Address      */
#define _PORTD_REGS                      CAST(port_registers_t, 0x400e1400)            /**< \brief PORTD Registers Address      */
#define _PORTE_REGS                      CAST(port_registers_t, 0x400e1600)            /**< \brief PORTE Registers Address      */
#define _PMC_REGS                        CAST(pmc_registers_t, 0x400e0600)             /**< \brief PMC Registers Address        */
#define _PWMC0_REGS                      CAST(pwmc_registers_t, 0x40020000)            /**< \brief PWMC0 Registers Address      */
#define _PWMC1_REGS                      CAST(pwmc_registers_t, 0x4005c000)            /**< \brief PWMC1 Registers Address      */
#define _QSPI_REGS                       CAST(qspi_registers_t, 0x4007c000)            /**< \brief QSPI Registers Address       */
#define _RSTC_REGS                       CAST(rstc_registers_t, 0x400e1800)            /**< \brief RSTC Registers Address       */
#define _RSWDT_REGS                      CAST(rswdt_registers_t, 0x400e1900)           /**< \brief RSWDT Registers Address      */
#define _RTC_REGS                        CAST(rtc_registers_t, 0x400e1860)             /**< \brief RTC Registers Address        */
#define _RTT_REGS                        CAST(rtt_registers_t, 0x400e1830)             /**< \brief RTT Registers Address        */
#define _SDRAMC_REGS                     CAST(sdramc_registers_t, 0x40084000)          /**< \brief SDRAMC Registers Address     */
#define _SMC_REGS                        CAST(smc_registers_t, 0x40080000)             /**< \brief SMC Registers Address        */
#define _SPI0_REGS                       CAST(spi_registers_t, 0x40008000)             /**< \brief SPI0 Registers Address       */
#define _SPI1_REGS                       CAST(spi_registers_t, 0x40058000)             /**< \brief SPI1 Registers Address       */
#define _SSC_REGS                        CAST(ssc_registers_t, 0x40004000)             /**< \brief SSC Registers Address        */
#define _SUPC_REGS                       CAST(supc_registers_t, 0x400e1810)            /**< \brief SUPC Registers Address       */
#define _TC0_REGS                        CAST(tc_registers_t, 0x4000c000)              /**< \brief TC0 Registers Address        */
#define _TC1_REGS                        CAST(tc_registers_t, 0x40010000)              /**< \brief TC1 Registers Address        */
#define _TC2_REGS                        CAST(tc_registers_t, 0x40014000)              /**< \brief TC2 Registers Address        */
#define _TC3_REGS                        CAST(tc_registers_t, 0x40054000)              /**< \brief TC3 Registers Address        */
#define _TRNG_REGS                       CAST(trng_registers_t, 0x40070000)            /**< \brief TRNG Registers Address       */
#define _TWI0_REGS                       CAST(twi_registers_t, 0x40018000)             /**< \brief TWI0 Registers Address       */
#define _TWI1_REGS                       CAST(twi_registers_t, 0x4001c000)             /**< \brief TWI1 Registers Address       */
#define _TWI2_REGS                       CAST(twi_registers_t, 0x40060000)             /**< \brief TWI2 Registers Address       */
#define _UART0_REGS                      CAST(uart_registers_t, 0x400e0800)            /**< \brief UART0 Registers Address      */
#define _UART1_REGS                      CAST(uart_registers_t, 0x400e0a00)            /**< \brief UART1 Registers Address      */
#define _UART2_REGS                      CAST(uart_registers_t, 0x400e1a00)            /**< \brief UART2 Registers Address      */
#define _UART3_REGS                      CAST(uart_registers_t, 0x400e1c00)            /**< \brief UART3 Registers Address      */
#define _UART4_REGS                      CAST(uart_registers_t, 0x400e1e00)            /**< \brief UART4 Registers Address      */
#define _USART0_REGS                     CAST(usart_registers_t, 0x40024000)           /**< \brief USART0 Registers Address     */
#define _USART1_REGS                     CAST(usart_registers_t, 0x40028000)           /**< \brief USART1 Registers Address     */
#define _USART2_REGS                     CAST(usart_registers_t, 0x4002c000)           /**< \brief USART2 Registers Address     */
#define _USBHS_REGS                      CAST(usbhs_registers_t, 0x40038000)           /**< \brief USBHS Registers Address      */
#define _UTMI_REGS                       CAST(utmi_registers_t, 0x400e0400)            /**< \brief UTMI Registers Address       */
#define _WDT_REGS                        CAST(wdt_registers_t, 0x400e1850)             /**< \brief WDT Registers Address        */
#define _XDMAC_REGS                      CAST(xdmac_registers_t, 0x40078000)           /**< \brief XDMAC Registers Address      */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CZ2038CA70144                          */
/* ************************************************************************** */

