zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz2038ca70144.h
#define _ACC_BASE_ADDRESS                (0x40044000UL)                                /**< \brief ACC Base Address             */
#define _AES_BASE_ADDRESS                (0x4006c000UL)                                /**< \brief AES Base Address             */
#define _AFEC0_BASE_ADDRESS              (0x4003c000UL)                                /**< \brief AFEC0 Base Address           */
#define _AFEC1_BASE_ADDRESS              (0x40064000UL)                                /**< \brief AFEC1 Base Address           */
#define _CHIPID_BASE_ADDRESS             (0x400e0940UL)                                /**< \brief CHIPID Base Address          */
#define _DACC_BASE_ADDRESS               (0x40040000UL)                                /**< \brief DACC Base Address            */
#define _EFC_BASE_ADDRESS                (0x400e0c00UL)                                /**< \brief EFC Base Address             */
#define _GMAC_BASE_ADDRESS               (0x40050000UL)                                /**< \brief GMAC Base Address            */
#define _GPBR_BASE_ADDRESS               (0x400e1890UL)                                /**< \brief GPBR Base Address            */
#define _HSMCI_BASE_ADDRESS              (0x40000000UL)                                /**< \brief HSMCI Base Address           */
#define _I2SC0_BASE_ADDRESS              (0x4008c000UL)                                /**< \brief I2SC0 Base Address           */
#define _I2SC1_BASE_ADDRESS              (0x40090000UL)                                /**< \brief I2SC1 Base Address           */
#define _ICM_BASE_ADDRESS                (0x40048000UL)                                /**< \brief ICM Base Address             */
#define _ISI_BASE_ADDRESS                (0x4004c000UL)                                /**< \brief ISI Base Address             */
#define _MATRIX_BASE_ADDRESS             (0x40088000UL)                                /**< \brief MATRIX Base Address          */
#define _MCAN0_BASE_ADDRESS              (0x40030000UL)                                /**< \brief MCAN0 Base Address           */
#define _MCAN1_BASE_ADDRESS              (0x40034000UL)                                /**< \brief MCAN1 Base Address           */
#define _MLB_BASE_ADDRESS                (0x40068000UL)                                /**< \brief MLB Base Address             */
#define _PORTA_BASE_ADDRESS              (0x400e0e00UL)                                /**< \brief PORTA Base Address           */
#define _PORTB_BASE_ADDRESS              (0x400e1000UL)                                /**< \brief PORTB Base Address           */
#define _PORTC_BASE_ADDRESS              (0x400e1200UL)                                /**< \brief PORTC Base Address           */
#define _PORTD_BASE_ADDRESS              (0x400e1400UL)                                /**< \brief PORTD Base Address           */
#define _PORTE_BASE_ADDRESS              (0x400e1600UL)                                /**< \brief PORTE Base Address           */
#define _PMC_BASE_ADDRESS                (0x400e0600UL)                                /**< \brief PMC Base Address             */
#define _PWMC0_BASE_ADDRESS              (0x40020000UL)                                /**< \brief PWMC0 Base Address           */
#define _PWMC1_BASE_ADDRESS              (0x4005c000UL)                                /**< \brief PWMC1 Base Address           */
#define _QSPI_BASE_ADDRESS               (0x4007c000UL)                                /**< \brief QSPI Base Address            */
#define _RSTC_BASE_ADDRESS               (0x400e1800UL)                                /**< \brief RSTC Base Address            */
#define _RSWDT_BASE_ADDRESS              (0x400e1900UL)                                /**< \brief RSWDT Base Address           */
#define _RTC_BASE_ADDRESS                (0x400e1860UL)                                /**< \brief RTC Base Address             */
#define _RTT_BASE_ADDRESS                (0x400e1830UL)                                /**< \brief RTT Base Address             */
#define _SDRAMC_BASE_ADDRESS             (0x40084000UL)                                /**< \brief SDRAMC Base Address          */
#define _SMC_BASE_ADDRESS                (0x40080000UL)                                /**< \brief SMC Base Address             */
#define _SPI0_BASE_ADDRESS               (0x40008000UL)                                /**< \brief SPI0 Base Address            */
#define _SPI1_BASE_ADDRESS               (0x40058000UL)                                /**< \brief SPI1 Base Address            */
#define _SSC_BASE_ADDRESS                (0x40004000UL)                                /**< \brief SSC Base Address             */
#define _SUPC_BASE_ADDRESS               (0x400e1810UL)                                /**< \brief SUPC Base Address            */
#define _TC0_BASE_ADDRESS                (0x4000c000UL)                                /**< \brief TC0 Base Address             */
#define _TC1_BASE_ADDRESS                (0x40010000UL)                                /**< \brief TC1 Base Address             */
#define _TC2_BASE_ADDRESS                (0x40014000UL)                                /**< \brief TC2 Base Address             */
#define _TC3_BASE_ADDRESS                (0x40054000UL)                                /**< \brief TC3 Base Address             */
#define _TRNG_BASE_ADDRESS               (0x40070000UL)                                /**< \brief TRNG Base Address            */
#define _TWI0_BASE_ADDRESS               (0x40018000UL)                                /**< \brief TWI0 Base Address            */
#define _TWI1_BASE_ADDRESS               (0x4001c000UL)                                /**< \brief TWI1 Base Address            */
#define _TWI2_BASE_ADDRESS               (0x40060000UL)                                /**< \brief TWI2 Base Address            */
#define _UART0_BASE_ADDRESS              (0x400e0800UL)                                /**< \brief UART0 Base Address           */
#define _UART1_BASE_ADDRESS              (0x400e0a00UL)                                /**< \brief UART1 Base Address           */
#define _UART2_BASE_ADDRESS              (0x400e1a00UL)                                /**< \brief UART2 Base Address           */
#define _UART3_BASE_ADDRESS              (0x400e1c00UL)                                /**< \brief UART3 Base Address           */
#define _UART4_BASE_ADDRESS              (0x400e1e00UL)                                /**< \brief UART4 Base Address           */
#define _USART0_BASE_ADDRESS             (0x40024000UL)                                /**< \brief USART0 Base Address          */
#define _USART1_BASE_ADDRESS             (0x40028000UL)                                /**< \brief USART1 Base Address          */
#define _USART2_BASE_ADDRESS             (0x4002c000UL)                                /**< \brief USART2 Base Address          */
#define _USBHS_BASE_ADDRESS              (0x40038000UL)                                /**< \brief USBHS Base Address           */
#define _UTMI_BASE_ADDRESS               (0x400e0400UL)                                /**< \brief UTMI Base Address            */
#define _WDT_BASE_ADDRESS                (0x400e1850UL)                                /**< \brief WDT Base Address             */
#define _XDMAC_BASE_ADDRESS              (0x40078000UL)                                /**< \brief XDMAC Base Address           */

/* ************************************************************************** */
/*   HARMONY MODULES DEFINITIONS FOR PIC32CZ2038CA70144                       */
/* ************************************************************************** */

